In [1]:
import pandas as pd

In [2]:
data = pd.read_excel("UNUM - Voluntary.xlsx")

In [4]:
data.head(10)

,"Volunteer Life, AD&D Plan",Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,Unnamed: 10,Unnamed: 11,Unnamed: 12,Unnamed: 13,Unnamed: 14,Unnamed: 15,Unnamed: 16
0,UNUM,NaN,NaN,NaN,NaN,Period:,12/01/2025-12/31/2025,Pay Period:,2025-12-01 00:00:00,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,#,EE ID,Name,Plan Name,Coverage Level,EE Amount,ER Amount,EE Life Total,Total,Note,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,NaN,2305,"An, Shuzhen",EE LIFE,10000,0,0.53,0.53,0.53,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
5,1,1729,"Bandelaria, Evelyn A",EE LIFE,10000,0,5.02,5.02,5.44,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
6,NaN,1729,"Bandelaria, Evelyn A",EE AD&D,10000,0.42,NaN,0.42,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
7,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
8,NaN,2247,"Brown, Samar B",EE LIFE,10000,0,0.53,0.53,0.95,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
9,NaN,2247,"Brown, Samar B",EE AD&D,10000,0.42,NaN,0.42,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

#Remove 3 rows.
Col 0 is UNUM
Col 1 is EEID
Col 2 is Name
Col 3 is Plan Name
Col 5 is EE Amount

In [ ]:
# [1,2,3,4,6] [eeid, name, plan_name, amount]

In [23]:
df = data
df = df[3:].copy() # remove top 3 rows because they're not data
df = df.iloc[:, [1,2,3,5]] # [eeid, name, plan_name, amount]
df.columns = ['eecode', 'name', 'plan_name', 'EE Deductable']
df['eename'] = df['name'].str.strip()  # rename 'name' to 'eename'
df = df[['eecode', 'eename', 'EE Deductable','plan_name']]
df.head(10)

   eecode                eename EE Deductable plan_name
3    2305           An, Shuzhen             0   EE LIFE
4     NaN                   NaN           NaN       NaN
5    1729  Bandelaria, Evelyn A             0   EE LIFE
6    1729  Bandelaria, Evelyn A          0.42   EE AD&D
7     NaN                   NaN           NaN       NaN
8    2247        Brown, Samar B             0   EE LIFE
9    2247        Brown, Samar B          0.42   EE AD&D
10    NaN                   NaN           NaN       NaN
11   2261       Caamal, Sasha K             0   EE LIFE
12   2261       Caamal, Sasha K          2.21   SP LIFE

## There's rows seperated by NaN. Need to remove these rows. Maybe by eecode that are NaN?

In [24]:
df = df.dropna(subset=['eecode'])
df.head(15)

   eecode                eename EE Deductable plan_name
3    2305           An, Shuzhen             0   EE LIFE
5    1729  Bandelaria, Evelyn A             0   EE LIFE
6    1729  Bandelaria, Evelyn A          0.42   EE AD&D
8    2247        Brown, Samar B             0   EE LIFE
9    2247        Brown, Samar B          0.42   EE AD&D
11   2261       Caamal, Sasha K             0   EE LIFE
12   2261       Caamal, Sasha K          2.21   SP LIFE
13   2261       Caamal, Sasha K          0.68   CH LIFE
14   2261       Caamal, Sasha K          0.42   EE AD&D
15   2261       Caamal, Sasha K          0.22   SP AD&D
16   2261       Caamal, Sasha K          0.07   CH AD&D
18   2081            Cai, Miley         18.09   EE LIFE
19   2081            Cai, Miley          3.42   CH LIFE
20   2081            Cai, Miley          4.18   EE AD&D
21   2081            Cai, Miley          0.35   CH AD&D

### Need to divide out by Plan Name

In [25]:
df['plan_name'].unique()

array(['EE LIFE', 'EE AD&D', 'SP LIFE', 'CH LIFE', 'SP AD&D', 'CH AD&D',
       'EE LIFE '], dtype=object)

### Seems like there's two EE Lifes. Combine them into one.

In [27]:
# Normalize data
df['plan_name'] = df['plan_name'].str.strip()

In [28]:
df.head(10)

   eecode                eename EE Deductable plan_name
3    2305           An, Shuzhen             0   EE LIFE
5    1729  Bandelaria, Evelyn A             0   EE LIFE
6    1729  Bandelaria, Evelyn A          0.42   EE AD&D
8    2247        Brown, Samar B             0   EE LIFE
9    2247        Brown, Samar B          0.42   EE AD&D
11   2261       Caamal, Sasha K             0   EE LIFE
12   2261       Caamal, Sasha K          2.21   SP LIFE
13   2261       Caamal, Sasha K          0.68   CH LIFE
14   2261       Caamal, Sasha K          0.42   EE AD&D
15   2261       Caamal, Sasha K          0.22   SP AD&D

In [32]:
df['plan_name'].unique()

array(['EE LIFE', 'EE AD&D', 'SP LIFE', 'CH LIFE', 'SP AD&D', 'CH AD&D'],
      dtype=object)